tap "bufbuild/buf"
tap "cmacrae/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "aws-cdk"
brew "python@3.11"
brew "awscli"
brew "cabal-install"
brew "ccd2iso"
brew "ccls"
brew "cmake"
brew "colordiff"
brew "coursier"
brew "ctags"
brew "dart-sdk"
brew "ddate"
brew "delve"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "gopls"
brew "gradle"
brew "gradle-completion"
brew "haskell-language-server"
brew "haskell-stack"
brew "helix"
brew "htop"
brew "hugo"
brew "jq"
brew "julia"
brew "kotlin-language-server"
brew "kubernetes-cli"
brew "kube-ps1"
brew "lua-language-server"
brew "markdownlint-cli"
brew "mas"
brew "metals"
brew "neovim"
brew "podman"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "r"
brew "ripgrep"
brew "rust-analyzer"
brew "rustup-init"
brew "sbt"
brew "shellcheck"
brew "shfmt"
brew "stern"
brew "stylua"
brew "subversion"
brew "watch"
brew "wget"
brew "zplug"
brew "zsh"
brew "bufbuild/buf/buf"
brew "cmacrae/formulae/spacebar"
cask "aerial"
cask "brooklyn"
cask "coconutbattery"
cask "corsair-icue"
cask "discord"
cask "dozer"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-meslo-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "github"
cask "godot"
cask "iterm2"
cask "kitty"
cask "lapce"
cask "monitorcontrol"
cask "nvidia-geforce-now"
cask "podman-desktop"
cask "postman"
cask "signal"
cask "slack"
cask "steam"
cask "telegram"
cask "thunderbird"
cask "visual-studio-code"
cask "vmware-fusion"
cask "warp"
cask "whisky"
mas "Controller", id: 1198176727
mas "Display Menu", id: 549083868
mas "Ecosia - The search engine that plants trees", id: 1463400445
mas "Ghostery – Privacy Ad Blocker", id: 1436953057
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Twitter", id: 1482454543
mas "Wipr", id: 1320666476
vscode "arcticicestudio.nord-visual-studio-code"
vscode "ethan-reesor.vscode-go-test-adapter"
vscode "fwcd.kotlin"
vscode "golang.go"
vscode "hbenl.vscode-test-explorer"
vscode "hbenl.vscode-test-explorer-liveshare"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "SirTori.indenticator"
vscode "Swellaby.vscode-rust-test-adapter"
vscode "vscodevim.vim"
