{
  "plugins": {
    "Comment.nvim": {
      "src": "https://github.com/numToStr/Comment.nvim"
    },
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip",
      "version": "2.0.0 - 3.0.0"
    },
    "auto-dark-mode.nvim": {
      "src": "https://github.com/f-person/auto-dark-mode.nvim"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer"
    },
    "cmp-cmdline": {
      "src": "https://github.com/hrsh7th/cmp-cmdline"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path"
    },
    "cmp_luasnip": {
      "src": "https://github.com/saadparwaiz1/cmp_luasnip"
    },
    "dashboard-nvim": {
      "src": "https://github.com/nvimdev/dashboard-nvim"
    },
    "dressing.nvim": {
      "src": "https://github.com/stevearc/dressing.nvim"
    },
    "formatter.nvim": {
      "src": "https://github.com/mhartington/formatter.nvim"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets"
    },
    "indent-blankline.nvim": {
      "src": "https://github.com/lukas-reineke/indent-blankline.nvim"
    },
    "inlay-hints.nvim": {
      "src": "https://github.com/MysticalDevil/inlay-hints.nvim"
    },
    "lazydev.nvim": {
      "src": "https://github.com/folke/lazydev.nvim"
    },
    "lspkind.nvim": {
      "src": "https://github.com/onsails/lspkind.nvim"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "mini.ai": {
      "src": "https://github.com/nvim-mini/mini.ai"
    },
    "mini.extra": {
      "src": "https://github.com/nvim-mini/mini.extra"
    },
    "mini.files": {
      "src": "https://github.com/nvim-mini/mini.files"
    },
    "mini.nvim": {
      "src": "https://github.com/echasnovski/mini.nvim"
    },
    "mini.pick": {
      "src": "https://github.com/nvim-mini/mini.pick"
    },
    "mini.surround": {
      "src": "https://github.com/nvim-mini/mini.surround"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp"
    },
    "nvim-colorizer.lua": {
      "src": "https://github.com/NvChad/nvim-colorizer.lua"
    },
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "nvim-dap-go": {
      "src": "https://github.com/leoluz/nvim-dap-go"
    },
    "nvim-dap-lldb": {
      "src": "https://github.com/julianolf/nvim-dap-lldb"
    },
    "nvim-dap-probe-rs": {
      "src": "https://github.com/abayomi185/nvim-dap-probe-rs"
    },
    "nvim-dap-ui": {
      "src": "https://github.com/rcarriga/nvim-dap-ui"
    },
    "nvim-dap-virtual-text": {
      "src": "https://github.com/theHamsta/nvim-dap-virtual-text"
    },
    "nvim-lightbulb": {
      "src": "https://github.com/kosayoda/nvim-lightbulb"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio"
    },
    "nvim-scrollview": {
      "src": "https://github.com/dstein64/nvim-scrollview"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "other.nvim": {
      "src": "https://github.com/rgroli/other.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "rose-pine": {
      "src": "https://github.com/rose-pine/neovim"
    },
    "statuscol.nvim": {
      "src": "https://github.com/luukvbaal/statuscol.nvim"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim"
    }
  }
}
